{
  "add_weight_norm": false,
  "architectures": [
    "LlamaMoEForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_llama_moe.LlamaMoEConfig",
    "AutoModel": "modeling_llama_moe_hf.LlamaMoEModel",
    "AutoModelForCausalLM": "modeling_llama_moe_hf.LlamaMoEForCausalLM"
  },
  "bos_token_id": 1,
  "calculator_type": "UniversalCalculator",
  "capacity_factor": 1.25,
  "drop_tokens": true,
  "dropped_padding": "zero",
  "eos_token_id": 2,
  "gate_add_noise": true,
  "gate_balance_loss_weight": 0.01,
  "gate_network": "mlp",
  "gate_noise_epsilon": 0.01,
  "gate_type": "TopKBalancedNoisyGate",
  "gate_use_balance": true,
  "gate_use_softmax": true,
  "gates": "mlp",
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 4096,
  "model_type": "llama_moe",
  "multiply_gate_scores": true,
  "num_attention_heads": 32,
  "num_experts": 8,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "num_selects": 2,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "score_scale_factor": 4.0,
  "size_experts": [
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ],
    [
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376,
      1376
    ]
  ],
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.31.0",
  "use_cache": false,
  "vocab_size": 32000,
  "top_t": 5,
  "collaborative_list": [[[3, 1, 6, 5, 7, 2, 4, 0], [3, 6, 7, 0, 4, 5, 2, 1], [4, 7, 6, 1, 5, 3, 0, 2], [6, 1, 0, 7, 4, 5, 2, 3], [5, 7, 2, 6, 1, 3, 0, 4], [7, 4, 1, 0, 6, 2, 3, 5], [3, 1, 4, 0, 5, 2, 7, 6], [5, 1, 4, 3, 0, 2, 6, 7]], [[6, 7, 1, 3, 5, 2, 4, 0], [2, 0, 6, 3, 5, 4, 7, 1], [4, 1, 5, 3, 6, 7, 0, 2], [5, 7, 1, 2, 0, 4, 6, 3], [2, 7, 5, 6, 1, 3, 0, 4], [3, 2, 4, 7, 1, 0, 6, 5], [0, 7, 1, 4, 2, 3, 5, 6], [0, 3, 6, 4, 5, 1, 2, 7]], [[3, 1, 2, 5, 6, 4, 7, 0], [4, 0, 6, 5, 7, 3, 2, 1], [4, 0, 3, 7, 6, 5, 1, 2], [5, 0, 2, 1, 4, 7, 6, 3], [1, 2, 7, 6, 0, 3, 5, 4], [3, 7, 6, 0, 1, 2, 4, 5], [7, 5, 1, 0, 2, 4, 3, 6], [6, 5, 2, 4, 1, 3, 0, 7]], [[2, 6, 5, 7, 4, 3, 1, 0], [5, 6, 3, 4, 7, 0, 2, 1], [0, 7, 4, 6, 5, 3, 1, 2], [6, 1, 7, 5, 4, 0, 2, 3], [2, 5, 7, 1, 0, 3, 6, 4], [1, 4, 0, 3, 7, 2, 6, 5], [3, 1, 0, 2, 4, 7, 5, 6], [2, 3, 0, 4, 5, 6, 1, 7]], [[5, 6, 7, 2, 4, 1, 3, 0], [6, 3, 0, 7, 5, 2, 4, 1], [7, 4, 6, 5, 0, 1, 3, 2], [4, 1, 6, 7, 5, 0, 2, 3], [3, 7, 5, 2, 0, 6, 1, 4], [0, 7, 4, 2, 3, 1, 6, 5], [1, 0, 2, 3, 5, 4, 7, 6], [2, 5, 4, 0, 3, 1, 6, 7]], [[5, 1, 6, 7, 3, 2, 4, 0], [3, 0, 6, 7, 4, 2, 5, 1], [6, 7, 3, 0, 5, 1, 4, 2], [1, 4, 7, 2, 0, 6, 5, 3], [5, 3, 7, 1, 0, 2, 6, 4], [4, 0, 7, 2, 6, 3, 1, 5], [2, 0, 1, 7, 3, 5, 4, 6], [2, 3, 4, 0, 1, 6, 5, 7]], [[5, 7, 4, 1, 2, 6, 3, 0], [4, 2, 5, 6, 0, 7, 3, 1], [3, 1, 7, 5, 0, 6, 4, 2], [6, 2, 7, 0, 1, 4, 5, 3], [5, 1, 7, 0, 6, 2, 3, 4], [0, 4, 1, 2, 7, 6, 3, 5], [3, 1, 4, 7, 2, 0, 5, 6], [2, 3, 4, 0, 6, 5, 1, 7]], [[1, 4, 3, 5, 6, 7, 2, 0], [0, 2, 3, 5, 6, 4, 7, 1], [6, 4, 1, 5, 3, 0, 7, 2], [5, 7, 1, 0, 4, 6, 2, 3], [2, 0, 5, 3, 7, 1, 6, 4], [7, 3, 4, 0, 1, 2, 6, 5], [2, 7, 3, 1, 4, 5, 0, 6], [5, 6, 3, 4, 0, 1, 2, 7]], [[2, 7, 6, 5, 3, 1, 4, 0], [5, 3, 4, 2, 0, 7, 6, 1], [0, 1, 3, 6, 4, 5, 7, 2], [4, 1, 2, 0, 6, 5, 7, 3], [3, 6, 1, 2, 5, 7, 0, 4], [1, 6, 0, 2, 4, 7, 3, 5], [7, 4, 5, 0, 2, 3, 1, 6], [6, 0, 2, 5, 1, 4, 3, 7]], [[7, 6, 4, 2, 5, 3, 1, 0], [3, 4, 2, 5, 6, 0, 7, 1], [4, 7, 3, 5, 1, 0, 6, 2], [1, 2, 6, 7, 5, 4, 0, 3], [1, 2, 5, 0, 3, 7, 6, 4], [6, 4, 2, 3, 0, 1, 7, 5], [5, 3, 0, 7, 2, 1, 4, 6], [0, 2, 3, 6, 5, 4, 1, 7]], [[1, 2, 4, 6, 7, 3, 5, 0], [3, 0, 6, 7, 4, 2, 5, 1], [5, 0, 4, 6, 1, 7, 3, 2], [1, 7, 5, 6, 2, 0, 4, 3], [7, 0, 2, 6, 1, 5, 3, 4], [6, 2, 3, 7, 1, 4, 0, 5], [5, 2, 4, 0, 1, 7, 3, 6], [4, 3, 5, 1, 6, 0, 2, 7]], [[7, 1, 4, 6, 5, 3, 2, 0], [6, 0, 7, 5, 3, 2, 4, 1], [4, 7, 6, 5, 1, 0, 3, 2], [5, 7, 4, 1, 6, 0, 2, 3], [2, 0, 3, 5, 1, 7, 6, 4], [3, 7, 2, 1, 4, 6, 0, 5], [1, 2, 7, 0, 5, 3, 4, 6], [0, 5, 2, 1, 3, 6, 4, 7]], [[1, 2, 7, 3, 4, 6, 5, 0], [0, 3, 7, 6, 2, 4, 5, 1], [5, 0, 7, 1, 3, 6, 4, 2], [1, 4, 6, 5, 7, 2, 0, 3], [7, 6, 3, 5, 1, 0, 2, 4], [6, 2, 7, 3, 4, 1, 0, 5], [5, 4, 3, 1, 7, 2, 0, 6], [4, 2, 5, 3, 1, 6, 0, 7]], [[4, 5, 3, 2, 7, 6, 1, 0], [6, 4, 5, 2, 7, 3, 0, 1], [5, 7, 6, 3, 4, 1, 0, 2], [7, 2, 0, 5, 6, 4, 1, 3], [0, 1, 6, 5, 2, 3, 7, 4], [0, 2, 7, 4, 1, 3, 6, 5], [1, 2, 4, 3, 5, 7, 0, 6], [3, 2, 5, 6, 0, 1, 4, 7]], [[3, 4, 5, 7, 2, 6, 1, 0], [6, 2, 4, 7, 0, 3, 5, 1], [3, 1, 5, 6, 0, 4, 7, 2], [0, 5, 2, 4, 7, 6, 1, 3], [7, 0, 1, 3, 6, 5, 2, 4], [7, 3, 2, 6, 0, 4, 1, 5], [1, 5, 2, 0, 4, 3, 7, 6], [4, 5, 0, 3, 6, 1, 2, 7]], [[6, 4, 5, 3, 1, 7, 2, 0], [3, 7, 0, 4, 5, 6, 2, 1], [4, 6, 5, 7, 0, 1, 3, 2], [1, 6, 0, 4, 7, 2, 5, 3], [2, 0, 7, 3, 1, 5, 6, 4], [7, 0, 2, 1, 4, 6, 3, 5], [3, 0, 2, 1, 4, 5, 7, 6], [5, 1, 4, 3, 2, 0, 6, 7]], [[7, 4, 2, 5, 1, 3, 6, 0], [3, 2, 5, 6, 7, 0, 4, 1], [6, 5, 3, 1, 0, 7, 4, 2], [1, 2, 4, 7, 5, 0, 6, 3], [6, 7, 5, 0, 3, 1, 2, 4], [6, 2, 4, 1, 0, 3, 7, 5], [2, 5, 4, 1, 3, 0, 7, 6], [0, 4, 1, 3, 2, 5, 6, 7]], [[2, 3, 5, 4, 1, 6, 7, 0], [2, 5, 7, 0, 3, 6, 4, 1], [1, 0, 6, 3, 7, 5, 4, 2], [4, 0, 6, 2, 7, 1, 5, 3], [5, 3, 0, 7, 6, 1, 2, 4], [4, 0, 7, 1, 6, 2, 3, 5], [7, 2, 3, 0, 1, 5, 4, 6], [6, 5, 1, 4, 3, 2, 0, 7]], [[6, 4, 7, 3, 5, 2, 1, 0], [7, 2, 5, 6, 3, 4, 0, 1], [4, 3, 1, 5, 7, 6, 0, 2], [4, 2, 0, 5, 7, 6, 1, 3], [3, 2, 0, 5, 1, 6, 7, 4], [6, 1, 3, 2, 0, 4, 7, 5], [5, 0, 7, 2, 1, 3, 4, 6], [1, 0, 6, 2, 3, 5, 4, 7]], [[6, 4, 3, 7, 1, 2, 5, 0], [3, 7, 5, 0, 6, 4, 2, 1], [6, 3, 7, 0, 4, 5, 1, 2], [1, 0, 2, 7, 4, 5, 6, 3], [5, 0, 3, 1, 6, 2, 7, 4], [4, 7, 1, 3, 0, 2, 6, 5], [2, 0, 1, 7, 4, 3, 5, 6], [5, 1, 3, 0, 2, 6, 4, 7]], [[2, 1, 5, 7, 3, 4, 6, 0], [6, 3, 4, 0, 5, 7, 2, 1], [0, 4, 5, 7, 1, 6, 3, 2], [7, 1, 6, 4, 0, 5, 2, 3], [2, 6, 7, 1, 5, 3, 0, 4], [6, 7, 2, 4, 0, 1, 3, 5], [1, 5, 4, 3, 7, 0, 2, 6], [3, 5, 4, 0, 1, 2, 6, 7]], [[7, 6, 5, 2, 3, 1, 4, 0], [3, 5, 7, 6, 2, 4, 0, 1], [6, 5, 1, 4, 0, 3, 7, 2], [4, 1, 5, 6, 2, 7, 0, 3], [7, 3, 5, 2, 1, 6, 0, 4], [1, 3, 0, 4, 2, 7, 6, 5], [2, 0, 1, 3, 5, 4, 7, 6], [0, 4, 1, 5, 3, 2, 6, 7]], [[5, 1, 2, 3, 4, 6, 7, 0], [5, 0, 4, 6, 3, 2, 7, 1], [7, 0, 6, 1, 3, 5, 4, 2], [6, 5, 4, 7, 1, 0, 2, 3], [5, 3, 1, 6, 7, 0, 2, 4], [4, 0, 1, 3, 6, 2, 7, 5], [3, 7, 2, 4, 1, 5, 0, 6], [2, 6, 3, 4, 1, 0, 5, 7]], [[7, 6, 3, 5, 4, 2, 1, 0], [7, 5, 2, 4, 6, 3, 0, 1], [4, 1, 7, 6, 3, 5, 0, 2], [5, 0, 6, 4, 2, 1, 7, 3], [2, 6, 1, 5, 3, 0, 7, 4], [3, 1, 4, 0, 7, 2, 6, 5], [4, 0, 3, 2, 1, 7, 5, 6], [0, 1, 2, 5, 6, 3, 4, 7]], [[4, 2, 5, 7, 6, 1, 3, 0], [6, 4, 2, 5, 7, 0, 3, 1], [5, 0, 1, 6, 4, 7, 3, 2], [7, 6, 5, 1, 0, 2, 4, 3], [0, 1, 7, 5, 2, 3, 6, 4], [2, 0, 3, 4, 1, 6, 7, 5], [1, 3, 2, 0, 7, 5, 4, 6], [3, 4, 0, 6, 1, 5, 2, 7]], [[1, 5, 4, 6, 2, 3, 7, 0], [0, 2, 3, 4, 6, 7, 5, 1], [7, 1, 5, 4, 6, 0, 3, 2], [4, 7, 5, 1, 0, 2, 6, 3], [3, 6, 0, 2, 1, 7, 5, 4], [6, 0, 3, 2, 7, 4, 1, 5], [5, 4, 7, 0, 2, 1, 3, 6], [2, 3, 6, 5, 4, 1, 0, 7]], [[5, 6, 4, 7, 2, 3, 1, 0], [2, 7, 6, 3, 5, 4, 0, 1], [1, 6, 3, 4, 7, 0, 5, 2], [4, 7, 2, 5, 1, 6, 0, 3], [3, 5, 7, 0, 6, 2, 1, 4], [0, 4, 7, 6, 3, 1, 2, 5], [0, 2, 7, 1, 5, 4, 3, 6], [1, 4, 6, 3, 5, 0, 2, 7]], [[4, 6, 2, 1, 5, 3, 7, 0], [3, 7, 2, 0, 4, 5, 6, 1], [7, 6, 1, 0, 5, 4, 3, 2], [1, 5, 4, 0, 7, 2, 6, 3], [0, 3, 6, 5, 1, 2, 7, 4], [7, 3, 6, 4, 0, 2, 1, 5], [0, 2, 5, 4, 7, 1, 3, 6], [2, 5, 1, 6, 3, 4, 0, 7]], [[6, 2, 3, 4, 7, 1, 5, 0], [7, 4, 2, 5, 6, 0, 3, 1], [0, 3, 6, 1, 5, 4, 7, 2], [5, 2, 6, 0, 1, 4, 7, 3], [1, 6, 5, 0, 7, 2, 3, 4], [3, 7, 6, 2, 4, 1, 0, 5], [0, 4, 2, 5, 7, 3, 1, 6], [1, 5, 6, 4, 0, 2, 3, 7]], [[1, 3, 7, 5, 6, 4, 2, 0], [6, 0, 2, 4, 5, 7, 3, 1], [3, 4, 1, 7, 6, 0, 5, 2], [2, 0, 5, 4, 1, 7, 6, 3], [2, 5, 3, 7, 1, 6, 0, 4], [7, 4, 3, 6, 0, 1, 2, 5], [1, 7, 5, 0, 2, 4, 3, 6], [5, 0, 6, 4, 2, 1, 3, 7]], [[5, 4, 7, 6, 1, 2, 3, 0], [7, 3, 2, 0, 5, 6, 4, 1], [6, 7, 3, 5, 1, 0, 4, 2], [4, 1, 2, 6, 0, 7, 5, 3], [3, 0, 6, 1, 7, 2, 5, 4], [0, 6, 7, 2, 1, 4, 3, 5], [5, 2, 4, 0, 1, 3, 7, 6], [1, 2, 5, 0, 4, 3, 6, 7]], [[6, 2, 5, 7, 3, 4, 1, 0], [3, 4, 5, 7, 6, 0, 2, 1], [3, 0, 7, 4, 6, 5, 1, 2], [1, 2, 7, 4, 0, 6, 5, 3], [5, 1, 7, 2, 3, 6, 0, 4], [4, 0, 7, 1, 6, 2, 3, 5], [0, 7, 5, 2, 4, 1, 3, 6], [0, 6, 2, 5, 4, 1, 3, 7]]]
}
